-- Strings.
SELECT '""'::jsonb;				-- OK.
 jsonb 
-------
 ""
(1 row)

SELECT $$''$$::jsonb;			-- ERROR, single quotes are not allowed
ERROR:  invalid input syntax for type json
LINE 1: SELECT $$''$$::jsonb;
               ^
DETAIL:  Token "'" is invalid.
CONTEXT:  JSON data, line 1: '...
SELECT '"abc"'::jsonb;			-- OK
 jsonb 
-------
 "abc"
(1 row)

SELECT '"abc'::jsonb;			-- ERROR, quotes not closed
ERROR:  invalid input syntax for type json
LINE 1: SELECT '"abc'::jsonb;
               ^
DETAIL:  Token ""abc" is invalid.
CONTEXT:  JSON data, line 1: "abc
SELECT '"abc
def"'::jsonb;					-- ERROR, unescaped newline in string constant
ERROR:  invalid input syntax for type json
LINE 1: SELECT '"abc
               ^
DETAIL:  Character with value 0x0a must be escaped.
CONTEXT:  JSON data, line 1: "abc
SELECT '"\n\"\\"'::jsonb;		-- OK, legal escapes
  jsonb   
----------
 "\n\"\\"
(1 row)

SELECT '"\v"'::jsonb;			-- ERROR, not a valid JSON escape
ERROR:  invalid input syntax for type json
LINE 1: SELECT '"\v"'::jsonb;
               ^
DETAIL:  Escape sequence "\v" is invalid.
CONTEXT:  JSON data, line 1: "\v...
SELECT '"\u"'::jsonb;			-- ERROR, incomplete escape
ERROR:  invalid input syntax for type json
LINE 1: SELECT '"\u"'::jsonb;
               ^
DETAIL:  "\u" must be followed by four hexadecimal digits.
CONTEXT:  JSON data, line 1: "\u"
SELECT '"\u00"'::jsonb;			-- ERROR, incomplete escape
ERROR:  invalid input syntax for type json
LINE 1: SELECT '"\u00"'::jsonb;
               ^
DETAIL:  "\u" must be followed by four hexadecimal digits.
CONTEXT:  JSON data, line 1: "\u00"
SELECT '"\u000g"'::jsonb;		-- ERROR, g is not a hex digit
ERROR:  invalid input syntax for type json
LINE 1: SELECT '"\u000g"'::jsonb;
               ^
DETAIL:  "\u" must be followed by four hexadecimal digits.
CONTEXT:  JSON data, line 1: "\u000g...
SELECT '"\u0000"'::jsonb;		-- OK, legal escape
   jsonb   
-----------
 "\\u0000"
(1 row)

-- use octet_length here so we don't get an odd unicode char in the
-- output
SELECT octet_length('"\uaBcD"'::jsonb::text); -- OK, uppercase and lower case both OK
 octet_length 
--------------
            5
(1 row)

-- Numbers.
SELECT '1'::jsonb;				-- OK
 jsonb 
-------
 1
(1 row)

SELECT '0'::jsonb;				-- OK
 jsonb 
-------
 0
(1 row)

SELECT '01'::jsonb;				-- ERROR, not valid according to JSON spec
ERROR:  invalid input syntax for type json
LINE 1: SELECT '01'::jsonb;
               ^
DETAIL:  Token "01" is invalid.
CONTEXT:  JSON data, line 1: 01
SELECT '0.1'::jsonb;				-- OK
 jsonb 
-------
 0.1
(1 row)

SELECT '9223372036854775808'::jsonb;	-- OK, even though it's too large for int8
        jsonb        
---------------------
 9223372036854775808
(1 row)

SELECT '1e100'::jsonb;			-- OK
                                                 jsonb                                                 
-------------------------------------------------------------------------------------------------------
 10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
(1 row)

SELECT '1.3e100'::jsonb;			-- OK
                                                 jsonb                                                 
-------------------------------------------------------------------------------------------------------
 13000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000
(1 row)

SELECT '1f2'::jsonb;				-- ERROR
ERROR:  invalid input syntax for type json
LINE 1: SELECT '1f2'::jsonb;
               ^
DETAIL:  Token "1f2" is invalid.
CONTEXT:  JSON data, line 1: 1f2
SELECT '0.x1'::jsonb;			-- ERROR
ERROR:  invalid input syntax for type json
LINE 1: SELECT '0.x1'::jsonb;
               ^
DETAIL:  Token "0.x1" is invalid.
CONTEXT:  JSON data, line 1: 0.x1
SELECT '1.3ex100'::jsonb;		-- ERROR
ERROR:  invalid input syntax for type json
LINE 1: SELECT '1.3ex100'::jsonb;
               ^
DETAIL:  Token "1.3ex100" is invalid.
CONTEXT:  JSON data, line 1: 1.3ex100
-- Arrays.
SELECT '[]'::jsonb;				-- OK
 jsonb 
-------
 []
(1 row)

SELECT '[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]'::jsonb;  -- OK
                                                                                                  jsonb                                                                                                   
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 [[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
(1 row)

SELECT '[1,2]'::jsonb;			-- OK
 jsonb  
--------
 [1, 2]
(1 row)

SELECT '[1,2,]'::jsonb;			-- ERROR, trailing comma
ERROR:  invalid input syntax for type json
LINE 1: SELECT '[1,2,]'::jsonb;
               ^
DETAIL:  Expected JSON value, but found "]".
CONTEXT:  JSON data, line 1: [1,2,]
SELECT '[1,2'::jsonb;			-- ERROR, no closing bracket
ERROR:  invalid input syntax for type json
LINE 1: SELECT '[1,2'::jsonb;
               ^
DETAIL:  The input string ended unexpectedly.
CONTEXT:  JSON data, line 1: [1,2
SELECT '[1,[2]'::jsonb;			-- ERROR, no closing bracket
ERROR:  invalid input syntax for type json
LINE 1: SELECT '[1,[2]'::jsonb;
               ^
DETAIL:  The input string ended unexpectedly.
CONTEXT:  JSON data, line 1: [1,[2]
-- Objects.
SELECT '{}'::jsonb;				-- OK
 jsonb 
-------
 {}
(1 row)

SELECT '{"abc"}'::jsonb;			-- ERROR, no value
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{"abc"}'::jsonb;
               ^
DETAIL:  Expected ":", but found "}".
CONTEXT:  JSON data, line 1: {"abc"}
SELECT '{"abc":1}'::jsonb;		-- OK
   jsonb    
------------
 {"abc": 1}
(1 row)

SELECT '{1:"abc"}'::jsonb;		-- ERROR, keys must be strings
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{1:"abc"}'::jsonb;
               ^
DETAIL:  Expected string or "}", but found "1".
CONTEXT:  JSON data, line 1: {1...
SELECT '{"abc",1}'::jsonb;		-- ERROR, wrong separator
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{"abc",1}'::jsonb;
               ^
DETAIL:  Expected ":", but found ",".
CONTEXT:  JSON data, line 1: {"abc",...
SELECT '{"abc"=1}'::jsonb;		-- ERROR, totally wrong separator
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{"abc"=1}'::jsonb;
               ^
DETAIL:  Token "=" is invalid.
CONTEXT:  JSON data, line 1: {"abc"=...
SELECT '{"abc"::1}'::jsonb;		-- ERROR, another wrong separator
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{"abc"::1}'::jsonb;
               ^
DETAIL:  Expected JSON value, but found ":".
CONTEXT:  JSON data, line 1: {"abc"::...
SELECT '{"abc":1,"def":2,"ghi":[3,4],"hij":{"klm":5,"nop":[6]}}'::jsonb; -- OK
                               jsonb                                
--------------------------------------------------------------------
 {"abc": 1, "def": 2, "ghi": [3, 4], "hij": {"klm": 5, "nop": [6]}}
(1 row)

SELECT '{"abc":1:2}'::jsonb;		-- ERROR, colon in wrong spot
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{"abc":1:2}'::jsonb;
               ^
DETAIL:  Expected "," or "}", but found ":".
CONTEXT:  JSON data, line 1: {"abc":1:...
SELECT '{"abc":1,3}'::jsonb;		-- ERROR, no value
ERROR:  invalid input syntax for type json
LINE 1: SELECT '{"abc":1,3}'::jsonb;
               ^
DETAIL:  Expected string, but found "3".
CONTEXT:  JSON data, line 1: {"abc":1,3...
-- Miscellaneous stuff.
SELECT 'true'::jsonb;			-- OK
 jsonb 
-------
 true
(1 row)

SELECT 'false'::jsonb;			-- OK
 jsonb 
-------
 false
(1 row)

SELECT 'null'::jsonb;			-- OK
 jsonb 
-------
 null
(1 row)

SELECT ' true '::jsonb;			-- OK, even with extra whitespace
 jsonb 
-------
 true
(1 row)

SELECT 'true false'::jsonb;		-- ERROR, too many values
ERROR:  invalid input syntax for type json
LINE 1: SELECT 'true false'::jsonb;
               ^
DETAIL:  Expected end of input, but found "false".
CONTEXT:  JSON data, line 1: true false
SELECT 'true, false'::jsonb;		-- ERROR, too many values
ERROR:  invalid input syntax for type json
LINE 1: SELECT 'true, false'::jsonb;
               ^
DETAIL:  Expected end of input, but found ",".
CONTEXT:  JSON data, line 1: true,...
SELECT 'truf'::jsonb;			-- ERROR, not a keyword
ERROR:  invalid input syntax for type json
LINE 1: SELECT 'truf'::jsonb;
               ^
DETAIL:  Token "truf" is invalid.
CONTEXT:  JSON data, line 1: truf
SELECT 'trues'::jsonb;			-- ERROR, not a keyword
ERROR:  invalid input syntax for type json
LINE 1: SELECT 'trues'::jsonb;
               ^
DETAIL:  Token "trues" is invalid.
CONTEXT:  JSON data, line 1: trues
SELECT ''::jsonb;				-- ERROR, no value
ERROR:  invalid input syntax for type json
LINE 1: SELECT ''::jsonb;
               ^
DETAIL:  The input string ended unexpectedly.
CONTEXT:  JSON data, line 1: 
SELECT '    '::jsonb;			-- ERROR, no value
ERROR:  invalid input syntax for type json
LINE 1: SELECT '    '::jsonb;
               ^
DETAIL:  The input string ended unexpectedly.
CONTEXT:  JSON data, line 1:     
-- make sure jsonb is passed throught json generators without being escaped
select array_to_json(ARRAY [jsonb '{"a":1}', jsonb '{"b":[2,3]}']);
      array_to_json       
--------------------------
 [{"a": 1},{"b": [2, 3]}]
(1 row)

-- jsonb extraction functions
CREATE TEMP TABLE test_jsonb (
       json_type text,
       test_json jsonb
);
INSERT INTO test_jsonb VALUES
('scalar','"a scalar"'),
('array','["zero", "one","two",null,"four","five"]'),
('object','{"field1":"val1","field2":"val2","field3":null}');
SELECT test_json -> 'x'
FROM test_jsonb
WHERE json_type = 'scalar';
ERROR:  Cannot call jsonb_object_field on a scalar
SELECT test_json -> 'x'
FROM test_jsonb
WHERE json_type = 'array';
ERROR:  Cannot call jsonb_object_field on an array
SELECT test_json -> 'x'
FROM test_jsonb
WHERE json_type = 'object';
 ?column? 
----------
 
(1 row)

SELECT test_json->'field2'
FROM test_jsonb
WHERE json_type = 'object';
 ?column? 
----------
 "val2"
(1 row)

SELECT test_json->>'field2'
FROM test_jsonb
WHERE json_type = 'object';
 ?column? 
----------
 val2
(1 row)

SELECT test_json -> 2
FROM test_jsonb
WHERE json_type = 'scalar';
ERROR:  Cannot call jsonb_array_element on a scalar
SELECT test_json -> 2
FROM test_jsonb
WHERE json_type = 'array';
 ?column? 
----------
 "two"
(1 row)

SELECT test_json -> 2
FROM test_jsonb
WHERE json_type = 'object';
ERROR:  Cannot call jsonb_array_element on an object
SELECT test_json->>2
FROM test_jsonb
WHERE json_type = 'array';
 ?column? 
----------
 two
(1 row)

SELECT jsonb_object_keys(test_json)
FROM test_jsonb
WHERE json_type = 'scalar';
ERROR:  Cannot call jsonb_object_keys on a scalar
SELECT jsonb_object_keys(test_json)
FROM test_jsonb
WHERE json_type = 'array';
ERROR:  Cannot call jsonb_object_keys on an array
SELECT jsonb_object_keys(test_json)
FROM test_jsonb
WHERE json_type = 'object';
 jsonb_object_keys 
-------------------
 field1
 field2
 field3
(3 rows)

-- nulls
select (test_json->'field3') is null as expect_false
from test_jsonb
where json_type = 'object';
 expect_false 
--------------
 f
(1 row)

select (test_json->>'field3') is null as expect_true
from test_jsonb
where json_type = 'object';
 expect_true 
-------------
 t
(1 row)

select (test_json->3) is null as expect_false
from test_jsonb
where json_type = 'array';
 expect_false 
--------------
 f
(1 row)

select (test_json->>3) is null as expect_true
from test_jsonb
where json_type = 'array';
 expect_true 
-------------
 t
(1 row)

-- array length
SELECT jsonb_array_length('[1,2,3,{"f1":1,"f2":[5,6]},4]');
 jsonb_array_length 
--------------------
                  5
(1 row)

SELECT jsonb_array_length('[]');
 jsonb_array_length 
--------------------
                  0
(1 row)

SELECT jsonb_array_length('{"f1":1,"f2":[5,6]}');
ERROR:  cannot get array length of a non-array
SELECT jsonb_array_length('4');
ERROR:  cannot get array length of a scalar
-- each
select jsonb_each('{"f1":[1,2,3],"f2":{"f3":1},"f4":null}');
     jsonb_each     
--------------------
 (f1,"[1, 2, 3]")
 (f2,"{""f3"": 1}")
 (f4,null)
(3 rows)

select * from jsonb_each('{"f1":[1,2,3],"f2":{"f3":1},"f4":null,"f5":99,"f6":"stringy"}') q;
 key |   value   
-----+-----------
 f1  | [1, 2, 3]
 f2  | {"f3": 1}
 f4  | null
 f5  | 99
 f6  | "stringy"
(5 rows)

select jsonb_each_text('{"f1":[1,2,3],"f2":{"f3":1},"f4":null,"f5":"null"}');
  jsonb_each_text   
--------------------
 (f1,"[1, 2, 3]")
 (f2,"{""f3"": 1}")
 (f4,)
 (f5,null)
(4 rows)

select * from jsonb_each_text('{"f1":[1,2,3],"f2":{"f3":1},"f4":null,"f5":99,"f6":"stringy"}') q;
 key |   value   
-----+-----------
 f1  | [1, 2, 3]
 f2  | {"f3": 1}
 f4  | 
 f5  | 99
 f6  | stringy
(5 rows)

-- extract_path, extract_path_as_text
select jsonb_extract_path('{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}','f4','f6');
 jsonb_extract_path 
--------------------
 "stringy"
(1 row)

select jsonb_extract_path('{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}','f2');
 jsonb_extract_path 
--------------------
 {"f3": 1}
(1 row)

select jsonb_extract_path('{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}','f2',0::text);
 jsonb_extract_path 
--------------------
 "f3"
(1 row)

select jsonb_extract_path('{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}','f2',1::text);
 jsonb_extract_path 
--------------------
 1
(1 row)

select jsonb_extract_path_text('{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}','f4','f6');
 jsonb_extract_path_text 
-------------------------
 stringy
(1 row)

select jsonb_extract_path_text('{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}','f2');
 jsonb_extract_path_text 
-------------------------
 {"f3": 1}
(1 row)

select jsonb_extract_path_text('{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}','f2',0::text);
 jsonb_extract_path_text 
-------------------------
 f3
(1 row)

select jsonb_extract_path_text('{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}','f2',1::text);
 jsonb_extract_path_text 
-------------------------
 1
(1 row)

-- extract_path nulls
select jsonb_extract_path('{"f2":{"f3":1},"f4":{"f5":null,"f6":"stringy"}}','f4','f5') is null as expect_false;
 expect_false 
--------------
 f
(1 row)

select jsonb_extract_path_text('{"f2":{"f3":1},"f4":{"f5":null,"f6":"stringy"}}','f4','f5') is null as expect_true;
 expect_true 
-------------
 t
(1 row)

select jsonb_extract_path('{"f2":{"f3":1},"f4":[0,1,2,null]}','f4','3') is null as expect_false;
 expect_false 
--------------
 f
(1 row)

select jsonb_extract_path_text('{"f2":{"f3":1},"f4":[0,1,2,null]}','f4','3') is null as expect_true;
 expect_true 
-------------
 t
(1 row)

-- extract_path operators
select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>array['f4','f6'];
 ?column?  
-----------
 "stringy"
(1 row)

select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>array['f2'];
 ?column?  
-----------
 {"f3": 1}
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>array['f2','0'];
 ?column? 
----------
 "f3"
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>array['f2','1'];
 ?column? 
----------
 1
(1 row)

select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>array['f4','f6'];
 ?column? 
----------
 stringy
(1 row)

select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>array['f2'];
 ?column?  
-----------
 {"f3": 1}
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>array['f2','0'];
 ?column? 
----------
 f3
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>array['f2','1'];
 ?column? 
----------
 1
(1 row)

-- same using array literals
select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>'{f4,f6}';
 ?column?  
-----------
 "stringy"
(1 row)

select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>'{f2}';
 ?column?  
-----------
 {"f3": 1}
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>'{f2,0}';
 ?column? 
----------
 "f3"
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>'{f2,1}';
 ?column? 
----------
 1
(1 row)

select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>'{f4,f6}';
 ?column? 
----------
 stringy
(1 row)

select '{"f2":{"f3":1},"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>'{f2}';
 ?column?  
-----------
 {"f3": 1}
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>'{f2,0}';
 ?column? 
----------
 f3
(1 row)

select '{"f2":["f3",1],"f4":{"f5":99,"f6":"stringy"}}'::jsonb#>>'{f2,1}';
 ?column? 
----------
 1
(1 row)

-- array_elements
select jsonb_array_elements('[1,true,[1,[2,3]],null,{"f1":1,"f2":[7,8,9]},false]');
    jsonb_array_elements    
----------------------------
 1
 true
 [1, [2, 3]]
 null
 {"f1": 1, "f2": [7, 8, 9]}
 false
(6 rows)

select * from jsonb_array_elements('[1,true,[1,[2,3]],null,{"f1":1,"f2":[7,8,9]},false]') q;
           value            
----------------------------
 1
 true
 [1, [2, 3]]
 null
 {"f1": 1, "f2": [7, 8, 9]}
 false
(6 rows)

-- populate_record
create type jbpop as (a text, b int, c timestamp);
select * from jsonb_populate_record(null::jbpop,'{"a":"blurfl","x":43.2}') q;
   a    | b | c 
--------+---+---
 blurfl |   | 
(1 row)

select * from jsonb_populate_record(row('x',3,'2012-12-31 15:30:56')::jbpop,'{"a":"blurfl","x":43.2}') q;
   a    | b |            c             
--------+---+--------------------------
 blurfl | 3 | Mon Dec 31 15:30:56 2012
(1 row)

select * from jsonb_populate_record(null::jbpop,'{"a":"blurfl","x":43.2}', true) q;
   a    | b | c 
--------+---+---
 blurfl |   | 
(1 row)

select * from jsonb_populate_record(row('x',3,'2012-12-31 15:30:56')::jbpop,'{"a":"blurfl","x":43.2}', true) q;
   a    | b |            c             
--------+---+--------------------------
 blurfl | 3 | Mon Dec 31 15:30:56 2012
(1 row)

select * from jsonb_populate_record(null::jbpop,'{"a":[100,200,false],"x":43.2}', true) q;
         a         | b | c 
-------------------+---+---
 [100, 200, false] |   | 
(1 row)

select * from jsonb_populate_record(row('x',3,'2012-12-31 15:30:56')::jbpop,'{"a":[100,200,false],"x":43.2}', true) q;
         a         | b |            c             
-------------------+---+--------------------------
 [100, 200, false] | 3 | Mon Dec 31 15:30:56 2012
(1 row)

select * from jsonb_populate_record(row('x',3,'2012-12-31 15:30:56')::jbpop,'{"c":[100,200,false],"x":43.2}', true) q;
ERROR:  invalid input syntax for type timestamp: "[100, 200, false]"
-- populate_recordset
select * from jsonb_populate_recordset(null::jbpop,'[{"a":"blurfl","x":43.2},{"b":3,"c":"2012-01-20 10:42:53"}]',false) q;
   a    | b |            c             
--------+---+--------------------------
 blurfl |   | 
        | 3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"a":"blurfl","x":43.2},{"b":3,"c":"2012-01-20 10:42:53"}]',false) q;
   a    | b  |            c             
--------+----+--------------------------
 blurfl | 99 | 
 def    |  3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(null::jbpop,'[{"a":"blurfl","x":43.2},{"b":3,"c":"2012-01-20 10:42:53"}]',true) q;
   a    | b |            c             
--------+---+--------------------------
 blurfl |   | 
        | 3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"a":"blurfl","x":43.2},{"b":3,"c":"2012-01-20 10:42:53"}]',true) q;
   a    | b  |            c             
--------+----+--------------------------
 blurfl | 99 | 
 def    |  3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"a":[100,200,300],"x":43.2},{"a":{"z":true},"b":3,"c":"2012-01-20 10:42:53"}]',true) q;
        a        | b  |            c             
-----------------+----+--------------------------
 [100, 200, 300] | 99 | 
 {"z": true}     |  3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"c":[100,200,300],"x":43.2},{"a":{"z":true},"b":3,"c":"2012-01-20 10:42:53"}]',true) q;
ERROR:  invalid input syntax for type timestamp: "[100, 200, 300]"
-- using the default use_json_as_text argument
select * from jsonb_populate_recordset(null::jbpop,'[{"a":"blurfl","x":43.2},{"b":3,"c":"2012-01-20 10:42:53"}]') q;
   a    | b |            c             
--------+---+--------------------------
 blurfl |   | 
        | 3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"a":"blurfl","x":43.2},{"b":3,"c":"2012-01-20 10:42:53"}]') q;
   a    | b  |            c             
--------+----+--------------------------
 blurfl | 99 | 
 def    |  3 | Fri Jan 20 10:42:53 2012
(2 rows)

select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"a":[100,200,300],"x":43.2},{"a":{"z":true},"b":3,"c":"2012-01-20 10:42:53"}]') q;
ERROR:  cannot call json_populate_recordset on a nested object
select * from jsonb_populate_recordset(row('def',99,null)::jbpop,'[{"c":[100,200,300],"x":43.2},{"a":{"z":true},"b":3,"c":"2012-01-20 10:42:53"}]') q;
ERROR:  cannot call json_populate_recordset on a nested object
-- handling of unicode surrogate pairs
select octet_length((jsonb '{ "a":  "\ud83d\ude04\ud83d\udc36" }' -> 'a')::text)  as correct_in_utf8;
 correct_in_utf8 
-----------------
              10
(1 row)

select jsonb '{ "a":  "\ud83d\ud83d" }' -> 'a'; -- 2 high surrogates in a row
ERROR:  invalid input syntax for type json
LINE 1: select jsonb '{ "a":  "\ud83d\ud83d" }' -> 'a';
                     ^
DETAIL:  Unicode high surrogate must not follow a high surrogate.
CONTEXT:  JSON data, line 1: { "a":...
select jsonb '{ "a":  "\ude04\ud83d" }' -> 'a'; -- surrogates in wrong order
ERROR:  invalid input syntax for type json
LINE 1: select jsonb '{ "a":  "\ude04\ud83d" }' -> 'a';
                     ^
DETAIL:  Unicode low surrogate must follow a high surrogate.
CONTEXT:  JSON data, line 1: { "a":...
select jsonb '{ "a":  "\ud83dX" }' -> 'a'; -- orphan high surrogate
ERROR:  invalid input syntax for type json
LINE 1: select jsonb '{ "a":  "\ud83dX" }' -> 'a';
                     ^
DETAIL:  Unicode low surrogate must follow a high surrogate.
CONTEXT:  JSON data, line 1: { "a":...
select jsonb '{ "a":  "\ude04X" }' -> 'a'; -- orphan low surrogate
ERROR:  invalid input syntax for type json
LINE 1: select jsonb '{ "a":  "\ude04X" }' -> 'a';
                     ^
DETAIL:  Unicode low surrogate must follow a high surrogate.
CONTEXT:  JSON data, line 1: { "a":...
--handling of simple unicode escapes
select jsonb '{ "a":  "the Copyright \u00a9 sign" }' ->> 'a' as correct_in_utf8;
   correct_in_utf8    
----------------------
 the Copyright Â© sign
(1 row)

select jsonb '{ "a":  "dollar \u0024 character" }' ->> 'a' as correct_everywhere;
 correct_everywhere 
--------------------
 dollar $ character
(1 row)

select jsonb '{ "a":  "null \u0000 escape" }' ->> 'a' as not_unescaped;
   not_unescaped    
--------------------
 null \u0000 escape
(1 row)

--jsonb_typeof() function
select value, jsonb_typeof(value)
  from (values (jsonb '123.4'),
               (jsonb '-1'),
               (jsonb '"foo"'),
               (jsonb 'true'),
               (jsonb 'false'),
               (jsonb 'null'),
               (jsonb '[1, 2, 3]'),
               (jsonb '[]'),
               (jsonb '{"x":"foo", "y":123}'),
               (jsonb '{}'),
               (NULL::jsonb))
      as data(value);
         value          | jsonb_typeof 
------------------------+--------------
 123.4                  | number
 -1                     | number
 "foo"                  | string
 true                   | boolean
 false                  | boolean
 null                   | null
 [1, 2, 3]              | array
 []                     | array
 {"x": "foo", "y": 123} | object
 {}                     | object
                        | 
(11 rows)

